{"src":["https:\/\/cdn04.carsforsale.com\/3\/706447\/8698698\/853851642.jpg","https:\/\/cdn04.carsforsale.com\/3\/706447\/8698698\/853851643.jpg","https:\/\/cdn04.carsforsale.com\/3\/706447\/8698698\/853851644.jpg","https:\/\/cdn04.carsforsale.com\/3\/706447\/8698698\/853851645.jpg","https:\/\/cdn04.carsforsale.com\/3\/706447\/8698698\/853851646.jpg","https:\/\/cdn04.carsforsale.com\/3\/706447\/8698698\/853851647.jpg","https:\/\/cdn04.carsforsale.com\/3\/706447\/8698698\/853851648.jpg","https:\/\/cdn04.carsforsale.com\/3\/706447\/8698698\/853851649.jpg","https:\/\/cdn04.carsforsale.com\/3\/706447\/8698698\/853851650.jpg","https:\/\/cdn04.carsforsale.com\/3\/706447\/8698698\/853851651.jpg","https:\/\/cdn04.carsforsale.com\/3\/706447\/8698698\/853852666.jpg","https:\/\/cdn04.carsforsale.com\/3\/706447\/8698698\/853852667.jpg","https:\/\/cdn04.carsforsale.com\/3\/706447\/8698698\/853852668.jpg","https:\/\/cdn04.carsforsale.com\/3\/706447\/8698698\/853852669.jpg"],"mileage":"","description":["The 2017 Explorer shines with sharp satin chrome accents throughout the body, from the unique Platinum grille to the rear liftgate. The bold new look is sure to make you the envy of the neighborhood. New available signature lighting complements the new elegant, sculpted exterior lines. Efficient LED lamps enhance visibility with bright, long-lasting illumination, making your interior as eye-catching as your exterior. Explorer makes it super-easy to load cargo when your hands are full. Simply kick your foot under the bumper and the available hands-free, foot-activated liftgate will open automatically. A new available 2.3L EcoBoost engine joins an Explorer powertrain lineup designed to fit your personal needs, with 3 engines offered to fit your needs. From long highway commutes to towing trailers through the country, theres an Explorer engine with the right power for your lifestyle. A 3,5L V6 comes standard with 290hp while the powerful 365hp 3.5L EcoBoost V6 boasts towing up to 5,000 pounds and come standard on Sport and Platinum models. The ultra-luxurious interior features authentic wood accents and premium leathers for the ultimate comfort experience. The leather-wrapped dashboard and steering wheel are styled with contrast stitching, providing style and functionality. An available system of ultrasonic sensors help you park the Explorer in any situation. The available front 180-degree camera sees around corners, down alleys and out of parking spots. Stay connected with friends, family, and all goings with the available SYNC with MyFord Touch infotainment system with hands-free calling, voice-activated entertainment, customizable instrument cluster screens and touch-screen controls."],"title":"2017 Ford Explorer ","total_results":"1534104","price":"32198","kilometers":"","total_pages":63922,"href":"https:\/\/www.carsforsale.com\/vehicle\/details\/28622945","brand":"Ford","reference_id":"28622945","year":"2017","model":"Explorer","specs":{"Engine":"2.3L I4","Mileage":"","Exterior Color":"Shadow Black","Transmission":"Automatic 6-Speed","Interior Color":"Medium Light Camel","Drive Train":"FWD","Fuel":""}}