{"src":["https:\/\/cdn04.carsforsale.com\/3\/1010897\/8702256\/853915756.jpg","https:\/\/cdn04.carsforsale.com\/3\/1010897\/8702256\/853915757.jpg","https:\/\/cdn04.carsforsale.com\/3\/1010897\/8702256\/853915758.jpg","https:\/\/cdn04.carsforsale.com\/3\/1010897\/8702256\/853915759.jpg","https:\/\/cdn04.carsforsale.com\/3\/1010897\/8702256\/853915760.jpg","https:\/\/cdn04.carsforsale.com\/3\/1010897\/8702256\/853915761.jpg","https:\/\/cdn04.carsforsale.com\/3\/1010897\/8702256\/853915762.jpg","https:\/\/cdn04.carsforsale.com\/3\/1010897\/8702256\/853915763.jpg","https:\/\/cdn04.carsforsale.com\/3\/1010897\/8702256\/853915764.jpg","https:\/\/cdn04.carsforsale.com\/3\/1010897\/8702256\/853915765.jpg","https:\/\/cdn04.carsforsale.com\/3\/1010897\/8702256\/853915766.jpg","https:\/\/cdn04.carsforsale.com\/3\/1010897\/8702256\/853915767.jpg"],"mileage":"33129","description":["-------------------See the Full Listing at WWW.CARboi.COM------------------- This Beautiful BMW is up for sale by Carboi.com (CAR BOY) All our vehicles come with Manufacturer Warranty and have clean title Plus a 10 Test Drive backed by our 10 day Money-back Guarantee for additional peace of mind. Please feel free to call us direct at 855-966-6694 or visit us online at www.carboi.com. We are your BMW and MERCEDES -BENZ Headquarters! Why Carboi? Because we are Transparent, We save you lots of Time and Money and have a high customer satisfaction rate! WE are the first HONEST car company! WE are bringing simplicity and trust back to car market place, By offering only the TOP 10% of vehicles in the industry. If its not Perfect its not Carboi. Our company is different from the traditional car dealerships! We work DIRECTLY with manufacturers, thereby eliminating wholesalers , middlemen, auction houses, retailers, and car dealers. This means we pass the savings directly to you. All our cars go under a 152 point inspection to ensure quality, and we offer a 10 DAY test Drive backed by our 10 day money back guarantee (They give you 10 minute we give you 10 DAYS). All our cars come very close to show room condition and are inspected 3 times before they get to you. GIVE US A TRY! You have nothing to lose and SO MUCH to gain! Call one of our friendly car expert now at 855-966-6694. We are Open 7 days a week 8 am to 8 pm. DISCLAIMER: The Photos and information in this add are representations of the cars we have on our website. Please visit www.Carboi.com or call one of our car experts at 855-966-6694 to see actual live inventory and listings."],"title":"2014 BMW X1 xDrive28i ","total_results":"38162","price":"18900","kilometers":53304.561,"total_pages":1592,"href":"https:\/\/www.carsforsale.com\/vehicle\/details\/28627648","brand":"BMW","reference_id":"28627648","year":"2014","model":"X1","specs":{"Engine":"2.0L I4 Turbocharger","Mileage":"33,129 miles","Exterior Color":"Brown","Transmission":"Automatic 8-Speed","Interior Color":"Beige","Drive Train":"AWD","Fuel":"Gasoline"}}