{"src":["https:\/\/cdn04.carsforsale.com\/3\/706447\/8698742\/853852190.jpg","https:\/\/cdn04.carsforsale.com\/3\/706447\/8698742\/853852191.jpg","https:\/\/cdn04.carsforsale.com\/3\/706447\/8698742\/853852192.jpg","https:\/\/cdn04.carsforsale.com\/3\/706447\/8698742\/853852193.jpg","https:\/\/cdn04.carsforsale.com\/3\/706447\/8698742\/853852194.jpg","https:\/\/cdn04.carsforsale.com\/3\/706447\/8698742\/853852195.jpg","https:\/\/cdn04.carsforsale.com\/3\/706447\/8698742\/853852196.jpg","https:\/\/cdn04.carsforsale.com\/3\/706447\/8698742\/853852197.jpg","https:\/\/cdn04.carsforsale.com\/3\/706447\/8698742\/853852198.jpg","https:\/\/cdn04.carsforsale.com\/3\/706447\/8698742\/853852199.jpg","https:\/\/cdn04.carsforsale.com\/3\/706447\/8698742\/853853055.jpg","https:\/\/cdn04.carsforsale.com\/3\/706447\/8698742\/853853056.jpg","https:\/\/cdn04.carsforsale.com\/3\/706447\/8698742\/853853057.jpg"],"mileage":"4","description":["Ford F-150 capability is legendary in the world of hardworking pickups. The F-150 is remarkably stronger, yet lighter by 700lbs compared to the previous model. The body of the F-150 is high-strength, military grade, aluminum alloy, delivering best-in-class maximum towing and payload. Greater strength with less weight achieves a 3,300-lb. maximum payload rating. Even the F-150 powered by the new 2.7L EcoBoost V6 can haul up to 2,250 lbs. when properly equipped. The 3.5L V6 is engineered to handle demanding everyday jobs and has a 5 percent better power-to-weight ratio than the previous 3.7L V6, towing up to 7,600 lbs. The 3.5L V6 puts out 283hp and 255 lb. ft. of torque. The available 3.5L EcoBoost V6 power ratings are quite impressive at 365hp and 450 lb. ft. of torque. The durable 5.0L V8 has a better power-to-weight ratio with 385hp and 387 lb. ft. torque. The 3.5L EcoBoost V6, in fact, delivers a best-in-class 12,200-lb. maximum tow rating. New Ford innovations will keep you working through all conditions; the BoxLink all-new configurable universal pickup box interface system secures a wide variety of available Ford and aftermarket accessories such as ramps, storage bins, dividers and many others including E-Track. LED Box Lights, stowable loading ramps, 110 volt AC plug-in-outlet and remote tailgate release systems are all available options and ways that the F-150 will make your life a little easier. Get comfortable after a hard day in the comfort of your cab, with the available new 8-inch LCD Productivity Screen provides useful information from fuel economy to towing data right in front of you. Available also for 2017 is the F-150 Raptor which is made for offroad adventures and is powered by a 3.5L twin-turbo V6 making 450hp and 510 lb-ft of torque."],"title":"2017 Ford F-150 ","total_results":"1534344","price":"34355","kilometers":6.436,"total_pages":63932,"href":"https:\/\/www.carsforsale.com\/vehicle\/details\/28622989","brand":"Ford","reference_id":"28622989","year":"2017","model":"F-150","specs":{"Engine":"5.0L V8","Mileage":"4 miles","Exterior Color":"Shadow Black","Transmission":"Automatic 6-Speed","Interior Color":"Dark Earth Gray","Drive Train":"4X2","Fuel":""}}