{"src":["https:\/\/cdn04.carsforsale.com\/3\/371704\/8853535\/856876345.jpg","https:\/\/cdn04.carsforsale.com\/3\/371704\/8853535\/856876346.jpg","https:\/\/cdn04.carsforsale.com\/3\/371704\/8853535\/856876347.jpg","https:\/\/cdn04.carsforsale.com\/3\/371704\/8853535\/856876348.jpg","https:\/\/cdn04.carsforsale.com\/3\/371704\/8853535\/856876349.jpg","https:\/\/cdn04.carsforsale.com\/3\/371704\/8853535\/856876350.jpg","https:\/\/cdn04.carsforsale.com\/3\/371704\/8853535\/856876351.jpg"],"mileage":"1","description":["CHEVROLET DEALER OF THE YEAR! You may qualify for additional incentives. We offer preferred pricing and VIP service to you directly through the Internet department. If you are looking for The NO Hassle Approach with No Back and Forth, then for more information please visit us at www.bomninchevrolet.com. Accessories and color may vary. Quoted price subject to change without notice to correct errors or omissions or in the event of inventory fluctuations. This is an individualized price quote and is valid solely in connection with a purchase by you, the recipient. Quoted price good on date of publication only. Price already include applicable manufacturer rebates and incentives which are subject to manufacturer incentive or rebate qualification criteria and requirements, and which may be contingent upon manufacturer finance company approval. Manufacturer incentive data (customer rebates) is provided by third parties and believed to be accurate as of the time of publication. Manufacturer incentives may expire at any time. Dealer service\/document fee of $895 is not included in quoted price. Tax, tag, electronic and registration fees not included. Standard features are based upon trim level. Price does not include dealer installed options or equipment. All features not on all vehicles. See Accessories listing for accessories particular to this vehicle. Internet Price includes the following incentives: $2,000 - Corvette Loyalty Private Offer. Exp. 03\/31\/2017, $1,000 - Chevrolet Down Payment Assistance Program. Exp. 03\/31\/2017, $1,500 - Chevrolet Select Model Bonus Cash Program. Exp. 03\/31\/2017, $500 - American Farm Bureau Member Special Offer. Exp. 05\/31\/2017"],"title":"2017 Chevrolet Corvette Z06 ","total_results":"1532698","price":"72991","kilometers":1.609,"total_pages":63864,"href":"https:\/\/www.carsforsale.com\/vehicle\/details\/28863331","brand":"Chevrolet","reference_id":"28863331","year":"2017","model":"Corvette","specs":{"Engine":"6.2L V8","Mileage":"1 miles","Exterior Color":"Torch Red","Transmission":"Automatic 8-Speed","Interior Color":"Kalahari","Drive Train":"RWD","Fuel":"Gasoline"}}