{"src":["https:\/\/assets.hemmings.com\/uimage\/59746431-770-0@2X.jpg?rev=14","https:\/\/assets.hemmings.com\/uimage\/59746432-100-0@2X.jpg?rev=14","https:\/\/assets.hemmings.com\/uimage\/59746433-100-0@2X.jpg?rev=14","https:\/\/assets.hemmings.com\/uimage\/59746434-100-0@2X.jpg?rev=14","https:\/\/assets.hemmings.com\/uimage\/59746435-100-0@2X.jpg?rev=14","https:\/\/assets.hemmings.com\/uimage\/59746436-100-0@2X.jpg?rev=14","https:\/\/assets.hemmings.com\/uimage\/59746437-100-0@2X.jpg?rev=14","https:\/\/assets.hemmings.com\/uimage\/59746438-100-0@2X.jpg?rev=14","https:\/\/assets.hemmings.com\/uimage\/59746439-100-0@2X.jpg?rev=14","https:\/\/assets.hemmings.com\/uimage\/59746440-100-0@2X.jpg?rev=14"],"mileage":"","seller_name":"Auctions America: 2017 Auburn Fall","title":"1969 Dodge Charger General Lee","total_results":" 27","price":"Auction","page_count":2,"year":"1969","href":"https:\/\/www.hemmings.com\/classifieds\/cars-for-sale\/dodge\/charger\/1976388.html","brand":"Dodge","reference_id":"1976388","kilometers":"","model":"Charger","specs":{"Location:":"Auburn, Indiana,  46706","description":["1969 Dodge Charger 'General Lee'","To be OFFERED AT AUCTION  at Auctions America's Auburn Fall event, August 31-3, 2017.","Chassis No.","XP29H9G300177","Estimate:","$ 40,000 - $ 50,000 US","The 1969 Dodge Charger was the choice of car to be featured in the popular television series and later movie, “The Dukes of Hazzard.” In its unmistakable livery, the General Lee is commonly named as a favorite “star car” when such lists are compiled. When you view the Warner Bros. VIP Studio Tour website, The General Lee is one of the first cars mentioned when promoting their own Picture Car Museum in the associated video.","The red-and-white Starsky and Hutch Ford Torinos apart, probably no automotive screen icon has been so replicated as General Lee, famously driven by Bo and Luke in the long-running television series. No fewer than 256 cars were used in the making of the series, three TV movies and a feature film. The cars were all 1968 and ’69 Dodge Chargers, in characteristic orange with 01 on the side and a Confederate naval jack on the roof. A variety of engines came into play, based on the cars as found and scene requirements. Most had TorqueFlite A727 automatic transmissions.","This particular example of General Lee is presented with George Barris’ signature on the hood with his hand-written note that reads “Hollywood Star Car Collection.”","Running with a V-8 engine that is paired with a console-shift automatic transmission, the Charger has Carroll Shelby wheels, Cooper Cobra Radial GT tires, covered headlights, factory “quick-fill” fuel cap, CB antenna, and the stout black bumper guard up front. The original appearing interior features bucket seats, wood-grained trim on the console (with locking compartment), instrumentation that includes the tachometer\/clock combination (“tic-toc-tach”), seat belts, and matching tan door panels. Among the conveniences is factory Airtemp air conditioning, AM radio, CB radio; power steering and brakes. With approximately 30,000 miles showing on the odometer, you can add some special miles to the General Lee Charger on your favorite backroads and kick up some dust of your own.","Auction"]}}