{"src":["https:\/\/assets.hemmings.com\/uimage\/60132393-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/60132394-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/60132395-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/60132396-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/60132397-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/60132398-770-0@2X.jpg?rev=1"],"mileage":79001,"seller_name":"Gallery Aaldering","title":"1961 Maserati 3500GT for Sale","total_results":" 71","price":"Inquire","page_count":5,"year":"1961","href":"https:\/\/www.hemmings.com\/classifieds\/dealer\/maserati\/3500gt\/1996774.html","brand":"Maserati","reference_id":"1996774","kilometers":127112.609,"model":"3500GT","specs":{"Interior:":"Black","Location:":"Brummen, NETHERLANDS","description":["Fantastic Maserati 3500 GT. This car was supplied from new to a European customer in 1961. After a short period it was exported to Canada. In 1989 it was sold to an American and after two months it was sold to a woman in the UK. In 1994 a Dutchman bought the car and exported it to the Netherlands. This last owner kept it in his possession for more than 24 years. The car has been fully restored and technically overhauled during a 20 years period. This restoration was done very professionally, with precision and the right feeling for originality. The engine was completely overhauled by Peschmacher in Germany. Technically in a fantastic shape! The body is straight and beautiful. All panel fittings are as they should and the paintwork is beautiful. Of course, the chassis is rock solid and free from rust. It has been finished in silver metallic with stunning black leather upholstery. A Spotless 3500 GT in a fully restored condition! Bei uns können Sie auch leasen oder finanzieren! Unser Leasingpartner bietet maßgeschneiderte Lösungen für private und gewerbliche Kunden. Mehr als 350 Fahrzeuge im Bestand. Auf Wunsch liefern wir Ihren Fahrzeug mit TÜV und H-Kennzeichen nur wen älter als 30 Jahre. Keine zusätzlichen Steuern. The Gallery ist nur 20 km von der deutschen Grenze.","Price in euro's € 219.500,-"],"Exterior:":"Silver","Condition:":"Excellent","Transmission:":"Manual","Mileage:":"79.001"}}