{"src":["https:\/\/assets.hemmings.com\/uimage\/60502012-770-0@2X.jpg?rev=3","https:\/\/assets.hemmings.com\/uimage\/60502013-770-0@2X.jpg?rev=3","https:\/\/assets.hemmings.com\/uimage\/60502014-770-0@2X.jpg?rev=3","https:\/\/assets.hemmings.com\/uimage\/60502015-770-0@2X.jpg?rev=3","https:\/\/assets.hemmings.com\/uimage\/60502016-770-0@2X.jpg?rev=3","https:\/\/assets.hemmings.com\/uimage\/60502017-770-0@2X.jpg?rev=3","https:\/\/assets.hemmings.com\/uimage\/60502018-770-0@2X.jpg?rev=3","https:\/\/assets.hemmings.com\/uimage\/60502019-770-0@2X.jpg?rev=3"],"mileage":93000,"seller_name":"Bid Network Online: Classic Car Auction ","title":"1961 Chevrolet Corvette","total_results":" 172","price":"59000","page_count":12,"year":"1961","href":"https:\/\/www.hemmings.com\/classifieds\/cars-for-sale\/chevrolet\/corvette\/2005384.html","brand":"Chevrolet","reference_id":"2005384","kilometers":149637,"model":"Corvette","specs":{"Interior:":"Gold","Location:":"Los Angeles, California,  90304","description":["1961 Chevrolet Corvette Convertible For Sale in Southington, Connecticut  06489","If you are searching for something fast, fun, and fierce that is brimming with classic authenticity than look no further because this 1961 Chevy Corvette Convertible is perfect for you!  This two-door sports car features a curvaceous yet sporty styling that has become an icon of American made sports cars.  With lovely maroon and white paint, complimented by an exceptionally clean Fawn interior, this carefree convertible is dressed to impress and sure to turn heads.  Powered by a 283 V-8 engine that is mated with 4-speed manual transmission, this Corvette offers performance standards to the tune of 245 horsepower.  This white top convertible comes with 93,000 miles and she is eager to get out on the road for open top season!","The Corvette was first produced for the 1953 model year and has been in production through seven generations.  This 1961 Corvette Convertible is a first generation Vette, also known as the C1.  The entire C1 generation saw various changes to its overall design throughout its 9 year run.  A notable change for the vehicles produced in 1961 was a redesign to its rear that included the addition of a \"duck tale\" with four round lights.  This change proved a model success and would continue for all following model year Corvettes until 2014.  This 1961 Corvette comes with a rebuilt motor and transmission.  It has been very well maintained and upholds its true 1961 luster, which makes it ideal for any true appreciator or collector of classic American sports cars.","This 1961 Chevrolet Corvette Convertible is a must see\/drive!  In fact, come see for yourself!  You will agree that you cannot find another 1961 Corvette Convertible dressed in maroon and white, in this condition for the asking price.  Call today for more information on how you can take a stroll down memory lane with this impressive classic gem!"],"Exterior:":"Red","Condition:":"Good","Mileage:":"93000"}}