{"src":["https:\/\/assets.hemmings.com\/uimage\/61095974-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61095975-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61095976-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61095977-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61095978-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61095979-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61095980-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61095981-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61095982-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61095983-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61095984-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61095985-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61095986-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61095987-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61095988-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61095989-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61095990-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61095991-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61095992-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61095993-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61095994-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61095995-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61095996-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61095997-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61095998-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61095999-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61096000-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61096001-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61096002-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61096003-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61096004-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61096005-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61096006-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61096007-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61096008-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61096009-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61096010-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61096011-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61096012-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61096013-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61096014-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61096015-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61096016-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61096017-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61096018-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61096019-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61096020-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61096021-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61096022-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61096023-770-0@2X.jpg?rev=2"],"mileage":5992,"seller_name":"RK Motors Charlotte","title":"1965 Superformance Cobra for Sale","total_results":" 31199","price":"62900","page_count":2080,"year":"1965","href":"https:\/\/www.hemmings.com\/classifieds\/dealer\/superformance\/cobra\/2031335.html","brand":"Superformance","reference_id":"2031335","kilometers":9641.128,"model":"Cobra","specs":{"Interior:":"Black","Location:":"Charlotte, North Carolina,  28269","description":["The world of Cobra roadsters is much like the world of street rods: there are nice cars and then there are cars that take things to a whole new level. That means Cobra enthusiasts don't have to look very hard to find a great variety of aftermarket support, and that makes it pretty easy to build a roadster any way they like it. The problem then becomes the amount of time and money that such a massive undertaking requires. After spending years writing check after check to shop after shop, the enthusiast finally gets to enjoy a car that, by that point in time, they might not even want. Fortunately, there is a better solution! Why not let your friends at RK Motors Charlotte sell you a top-notch, turn-key custom like this killer Superformance MKIII for half the price, and a fraction of the time, of building it yourself?","BODYWORK\/TRIM","As the only Shelby licensed replica of the original 1965 Cobra, this roadster's sublime Superformance body utilizes high quality, hand laminated fiberglass to create a rock-solid drop-top that provides a first-rate driving experience. Those stiffly reinforced panels, titled as a Special Construction Cobra in 2006, feature the smooth surfaces and typically tight gaps we've come to expect from top tier Cobra replicas. And that excellent fit and finish is a testament to both OEM-quality and a series of talented technicians. Those excellent aesthetics found glossy Indigo Blue Metallic 2-stage under Metallic Charcoal racing stripes. And overall, this Shelby's timeless combination of killer style, serious performance and contemporary build techniques creates an irresistible curve carver that'll keep onlookers marveling!","Detailing is crucial on a replica because that's where a lot of cars start to disappoint. Fortunately, you can tell the overall impression of one of these classics from about five feet away. And naturally, this Cobra hits all the right visuals! At the front of the car, an aggressive nose hangs chrome-trimmed headlights over mesh grilles, tinted, bullet-style parking lamps and polished quick lifts. A small hood anchors a riveted scoop in front of locking latches, polished wipers and tinted visors. Behind that hood, a full canvas top hangs Lexan side windows between a ''Superformance'' branded windshield, clear wind wings and a polished roll bar. At the sides of the car, coated pipes frame a Monza-style fuel filler and polished heat extractors. And at the back of the car, chrome-trimmed tail lamps combine with a chrome tag light to illuminate a locking trunk handle and two more polished quick lifts.","ENGINE","Tilt this roadster's lightweight hood and you'll find a hot Roush Performance 427 R small block that twists a heady 550 horsepower into 535 lb.\/ft. of tire-killing torque! Built from the ground up as your ticket to major acceleration and insane speed, this stout mill is founded on an iron block, a steel crank, a roller cam, H-beam connecting rods and forged aluminum pistons. At the top of the surly engine, a Roush-branded air cleaner floats a reusable filter element above a coated Proform carburetor. That carb feeds an Edelbrock Victor Jr. intake, which is seated between lightweight aluminum heads. Those CNC-massaged caps hide tough hydraulic roller lifters under a polished, Cobra-branded breather and trick Roush valve covers. Fire is provided by an MSD Blaster 2 coil, which is connected to an MSD distributor and loomed Ford Racing plug wires. Cooling comes courtesy of a shrouded radiator, which fronts dual electric puller fans and a polished expansion tank. Ceramic-coated headers evacuate spent gases in to the aforementioned side-pipes. At the front of the block, billet pulleys spin a fresh alternator opposite modern power steering. And the dyno-tuned engine features a roster of well-planned details, including a polished fuel pump, braided fuel lines and a quality Weiand water pump.","DRIVETRAIN\/SUSPENSION","One of the best things about buying any high quality replica is the modern hardware underneath. Fully sorted and ready to roll, this roadster's Superformance heavy wall Jig-welded frame and fully independent suspension are poised to challenge the toughest turns you can find! At the center of those bones, a rugged Tremec 5-speed twists a tough Dana third member. Turns come courtesy of manual rack-and-pinion steering. Solid stops are provided by power-assisted Wilwood calipers, which clamp four vented discs. Torque meets the tarmac through alloy knock-offs, which twist 255\/60R15 Yokohama Avid S\/Ts in front of 295\/50R15 Yokohama Avid S\/Ts. And details like braided lines and a deep-sump oil pan round out an otherwise impressive build.","INTERIOR","Cobra interiors have always been stylish and simple, and one look inside this roadster reveals just how serious the car's aspirations are when it comes to being driver-focused. Buff bucket seats wear tight leather hides. In front of those seats, a Cobra-branded dash hangs a clean combination of Smiths and Auto Meter gauges beside a locking glovebox that features a familiar Carroll Shelby signature. At the sides of that dash, lightweight doors found polished poppers behind simple panels. Below those doors, clean carpet centers a booted e-brake and polished shifter between a polished fire extinguisher and colorful Superformance floor mats. The driver feels the asphalt through a polished steering wheel, which twists a leather-wrapped rim. And the passenger stows cargo in a fully finished trunk.","OUR SALE INCLUDES THE FOLLOWING ACCESSORIES","A vinyl cockpit cover","Well assembled, thrilling to drive and ready to deliver the ride of your life, this Cobra is sure to satisfy anyone who has a pulse. Why waste valuable time waiting for a car to be built when we have a first-class roadster sitting right here in our RK Motors Charlotte showroom? Don't miss your opportunity to own this spectacular turnkey classic!","SUMMARY","427 cubic inch Roush 427 R V8 \/ 550 horsepower","Tremec TKO600 5-speed manual transmission \/ Dana rear axle","Superformance jig-welded frame \/ Fully independent suspension","Superformance fiberglass body \/ Canvas top with Lexan side windows","Indigo Blue Metallic paint \/ Metallic Charcoal stripes","Wilwood 4-wheel power disc brakes \/ Rack-and-pinion steering","Leather interior","Sale includes a vinyl cockpit cover","15-inch alloy wheels","Ceramic-coated side-pipe exhaust"],"Exterior:":"Indigo Blue","Condition:":"Excellent","Transmission:":"Manual","Mileage:":"5992"}}