{"src":["https:\/\/assets.hemmings.com\/uimage\/61324725-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324726-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324727-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324728-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324729-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324730-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324731-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324732-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324733-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324734-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324735-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324736-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324737-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324738-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324739-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324740-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324741-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324742-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324743-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324744-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324745-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324746-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324747-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324748-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324749-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324750-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324751-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324752-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324753-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324754-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324755-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324756-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324757-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324758-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324759-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324760-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324761-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324762-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324763-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324764-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324765-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324766-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324767-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324768-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324769-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324770-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324771-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324772-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324773-770-0@2X.jpg?rev=2","https:\/\/assets.hemmings.com\/uimage\/61324774-770-0@2X.jpg?rev=2"],"mileage":689,"seller_name":"Streetside Classics - Tampa","title":"1971 Ford Mustang Fastback Restomod","total_results":" 28831","price":"99995","page_count":1923,"year":"1971","href":"https:\/\/www.hemmings.com\/classifieds\/dealer\/ford\/mustang\/2041981.html","brand":"Ford","reference_id":"2041981","kilometers":1108.601,"model":"Mustang","specs":{"Interior:":"Black","Location:":"Lutz, Florida,  33559","description":["We could tell you this is a 1971 Ford Mustang Mach 1, but you already know is much more than that.  The first impression screams restomod, and features like the custom elongated body, modern racecar interior, supercharged 502ci V8 let you know this is 100% a custom build... and you 100% want it.  And did we mention celebrity ownership?","''Wow.'' That's all most people manage to say when they see this one because a build this unique instantly takes your breath away.  It starts with a design you always wished the 1971 Mustang could be.  It was one of Ford's longest Mustangs ever, and this custom build actually even adds to that total.  But in the process the front end gets custom and fully integrated.  Plus, the sleek slope of the fastback rear is now met with much more dramatic integrated spoiler.  And as you see the line for both of these elements develop staring at the rear window, you realize this classic American has an Italian exotic's level of elegance.  Adding to this glamor factory is showroom-ready application of Pepper Gray Metallic.  Add in black stripes, and it's the color of the last Eleanor – which makes sense because this car is a star. This is the kind of full custom build that you can stare at for hours.  After all, it has so many custom pieces like the power bulge hood, blacked-out billet grille, hood pins, Shelby taillights, Colorado Customs wheels, and so much more.  And just in case this one didn't already excite, just know that this coupe belonged to All-Star third basemen Evan Longoria.","The black of the grille and custom stripes on the outside are the perfect complement to introduce the full black interior.  And the moment you spot the swing-out supports for the roll bars, you know this coupe means business.  Sparco Italian leather racing seats, five-point harnesses, and the back seat space taken up by the rest of the 10-point cage finish off this race-ready packaging.  As your hand grips the Momo steering wheel, and you right one perfectly falls on the Hurst shifter, this instantly lets you senses know you're in for a wild wire in this pony car.  It starts up with a roar and a woosh as the full set of AutoMeter Pro-Comp gauges begin to dance.  But any time this is not the right soundtrack for you, an Alpine AM\/FM\/CD stereo connected to a 700-watt speaker system has the power to give you whatever tunes you want.","Then again, you may never even want to leave your garage because the engine bay will have you mesmerized.  In fact, you better have sunglasses before you open the hood.  With every polished component imaginable reflecting off of the smooth painted side walls, you know there was the kind of money invested in just the shine that would rival what some people spend on their whole vehicle.  And beneath this style is a ton of substance.  Because while there are running ponies on the valve covers, this one is really massive bow tie power.  You're looking at Chevrolet's gigantic and stout 502 cubic-inch RamJet big block V8 with fuel injection.  And if earth-shattering displacement wasn't enough, you also have a Vortech supercharger.  That means it's estimated at a supercar-level 725 horsepower.  Best of all, you have complete control over this monstrous motor thanks to the six-speed manual transmission. And while the motor has you hypnotized, don't forget to check out the undercarriage photos.  There you'll spot one of the cleanest builds around thanks to less than 700 miles on this whole car.  Plus, it has a strong custom chassis by Art Morrison that includes a Mustang II style independent front suspension with tubular A-arms and a triangulated four-link in the rear.  It offers a truly superior driving experience with adjustable coilovers and Baer vented & slotted disc brakes at each wheel.","With so much time, money, and components in this build, we just don't have the space to go over everything.  So give us a call for all the details and maintenance records.  But while you're dreaming of this amazing custom build, just know that it has the nicknamed the ''Machstang.'' You'll need to know that because so many foreign exotic car owners will want to know what just passed them!  Don't miss this one-of-a-kind.  Call today!!!"],"Exterior:":"Eleanor Pepper Gray","Transmission:":"Manual","Mileage:":"689"}}