{"src":["https:\/\/assets.hemmings.com\/uimage\/56757001-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757002-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757003-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757004-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757005-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757006-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757007-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757008-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757009-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757010-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757011-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757012-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757013-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757014-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757015-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757016-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757017-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757018-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757019-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757020-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757021-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757022-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757023-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757024-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757025-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757026-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757027-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757029-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757030-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757031-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757032-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757033-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757034-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757035-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757036-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757037-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757038-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757039-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757040-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757041-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757042-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757043-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757044-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757045-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757046-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757047-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757048-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757049-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757050-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/56757051-770-0@2X.jpg?rev=1"],"mileage":66204,"seller_name":"MotoeXotica Classic Cars","title":"1961 Jaguar MK 2 3.8L","total_results":" 177","price":"15900","page_count":12,"year":"1961","href":"https:\/\/www.hemmings.com\/classifieds\/dealer\/jaguar\/mk-2\/1885394.html","brand":"Jaguar","reference_id":"1885394","kilometers":106522.236,"model":"MK","specs":{"Interior:":"Blue Leather","Location:":"St. Louis, Missouri,  63026","description":["1961 Jaguar Mark 2 3.8L Saloon","Same owner since 1999","Jaguar 3.8L DOHC inline six-cylinder engine","Rare four-speed transmission with overdrive","Converted to electronic ignition (no more points or condenser)","Newer exhaust","Old English White (code 8313L) exterior with Blue Connolly Leather interior","Restored original upholstery","Restored original burled walnut dashboard and matching, flip-down trays behind driver and front passenger","New headliner and fantastic Wilton interior trunk wool","Miscellaneous maintenance receipts included and miscellaneous documents","With a nod to a more classic era of English motoring, MotoeXotica Classic Cars is happy to offer this 1961 Jaguar Mark 2 Saloon. Previously used as a special event vehicle for weddings and on Sundays, the previous owner drove this car for 17 years!","Finished in classic Old English White, the car's paint is in good order but there are minor blemishes visible during a close-up inspection such as rock chips, etc. The car's windows are intact and clear and otherwise in good shape. The car's lights are in very good shape, crack- and haze-free and its bumpers are in decent shape after all these years. This cat rolls on Goodyear Vector tires, size 195\/75R15, surrounding steel wheels topped by Jaguar hubcaps that display some patina after all these years. In addition, some of the exterior trim pieces show blemishing but the body panels are all straight.","The 3.8L engine was released in 1958. It retained the 3.4L's bore centers and a 4.2-inch stroke but was bored out to 3.4-inches for a total displacement of 3,781cc. The 3.8L had a number of detail differences from the 3.4L, particularly in its valve gear and carburetion.","The previous owner, out of Louisville Kentucky, in September 2000, replaced brake cylinder; in October 2001, replaced front shocks, lubricated timing chain and serviced transmission; in April 2002, replaced the front brake pads and sway bar links; in January 2005, replaced rear springs, flushed transmission fluid, made heat shield for oil; in December 2006, the exhaust manifolds were replaced and new exhaust added from manifolds back; in 2008, the engine cylinder head was overhauled; in August 2009, replaced oil filter and both valve cover gaskets; and repaired the charging system, replaced front and rear brake hoses in June 2012; in 2013, the silicone fluid and disc brakes were replaced; sometime in 2014, the car's clutch received an overhaul;","Inside, the original, blue Connolly Leather seats have been refreshed, look excellent and present a cool contrast to the exterior white. The Wilton wool carpet is in good shape, a new headliner was installed and the original burled walnut dashboard and matching trays behind driver and passenger have been restored. The radio is inoperable but the interior and instrument panel lights work as designed. The Wilton interior trunk wool is in fine shape.","The Jaguar Mark 2 is a medium-sized saloon car built from late 1959 to 1967 by Jaguar in Coventry, England. Twelve months before the announcement of the XJ6 the 2.4L and 3.4L Mark 2 models were renamed to Jaguar 240 and Jaguar 340 respectively. The previous Jaguar 2.4L and 3.4L models made between 1955 and 1959 have been identified as Mark 1 Jaguars since Jaguar produced this Mark 2 model.","Until the XJ, Jaguar's postwar saloons were usually denoted by Roman numerals (e.g. Mark VII, Mark VIII) while the Mark 2 used Arabic Numerals, denoted on the rear of the car as “MK 2.”","Adhering to Sir William Lyons' maxim of “grace, pace and space,” the Mark 2 was a fast and capable saloon. It came with a 120 horsepower, 2.4L engine, a 210 horsepower, 3.4L engine or a 220 horsepower 3.8L Jaguar XK engine. The 3.8 is similar to the unit used in the 3.8 E-Type (called XKE in the USA), having the same block, crank, connecting rods and pistons but different inlet manifold and carburetion (two SUs versus three on the E-Type in Europe) and therefore 30 horsepower less. The head of the six-cylinder engine in the Mark 2 had curved ports compared to the straight ports of the E-Type configuration. The 3.4L and 3.8L cars were fitted with twin SU HD6 carburetors and the 2.4L with twin Solex carburetors.","Compared to the Mark 1, appearance of the car was transformed by an increase of 18 percent in cabin glass area, greatly improving vision. The car was re-engineered above the waistline, slender front pillars allowed a wider windscreen and the rear window almost wrapped around to the enlarged side windows now with the familiar Jaguar D-shape above the back door and fully chromed frames for all the side windows. The radiator grille was amended and larger side, tail and fog lamps repositioned. Inside a new heating system was fitted and ducted to the rear compartment. There was an improved instrument layout that became standard for all Jaguar cars until the XJ series II of 1973.","The front suspension geometry was rearranged to raise the roll center and the rear track widened. Four-wheel disc brakes were now standard. Power steering, overdrive or automatic transmissions could be fitted at extra cost. The 3.8L was fitted with a limited-slip differential. The Mark 2 was more than 220 pounds heavier than the 2.4\/3.4 cars","A Jaguar with the 3.8L engine was capable of accelerating from 0-60 mph in 8.5 seconds and could reach a top speed of 125 mph.","This car is currently located at our facility in St. Louis, Missouri. Current mileage on the odometer shows 66,204 miles. It is sold as is, where is, on a clean and clear, actual mileage title. GET OUT AND DRIVE!!!","VIN: 214819"],"Exterior:":"Old English White","Condition:":"Excellent","Transmission:":"Manual","Mileage:":"66204"}}