{"src":["https:\/\/assets.hemmings.com\/uimage\/63611144-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/63611050-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/63611051-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/63611047-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/63611052-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/63611108-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/63611135-770-0@2X.jpg?rev=1","https:\/\/assets.hemmings.com\/uimage\/63611136-770-0@2X.jpg?rev=1"],"mileage":8400,"seller_name":null,"title":"1948 Chevrolet 3100 Five Window Pick-up Truck","total_results":" 7","price":"75000","page_count":1,"year":"1948","href":"https:\/\/www.hemmings.com\/classifieds\/cars-for-sale\/chevrolet\/3100\/2150796.html","brand":"Chevrolet","reference_id":"2150796","kilometers":13515.6,"model":"3100","specs":{"Interior:":"Saddle leather","Location:":"Antioch, Illinois,  60002","description":["1948 Chevrolet 3100 Five window pick-up truck,","Top Truck or Best in Show every time shown in the Midwest!  Meticulous and authentic frame-up resoration of 1948 Chevy 3100 five-window pick up truck.  Powder-coated under carriage and custom boxed frame. Currie 9 inch rear end, 350 Chevy 330 HP crate motor with 700R4 transmission.  Disc brakes on the front, drum on the rear. Original after-market visor gives character to this one-of-a-kind restoration.  Box floor is wood with chrome strips and has a custom caarpet to snap in place for parade riders or protection when stowing gear for car shows.","Custom saddle leather upholstery features unique Glide split-back bench seat with arm rests.  Bench seat lifts for amazing under-seat storage and CD changer. Seat backs tilt forward for acess to more storage. Pioneer 15-disc  CD player AM\/FM radio and sound system, power windows, Vintage Air, and true-to-original repro gauges and round side mirrors. Twin chrome exhaust pipes emit the sound you are looking for while staying treet legal!","Only 8400 miles on this beauty--ready for new owner to enjoy and take in the oohs and ahs on cruise nights and at car shows.  Restoration by renowned Frame-Up Wheel Works in Waukegan Illinois for six figures+.....can be yours today for $75,000.  Located on Wisconsin border  in Antioch, IL  near Lake Geneva, WI"],"Exterior:":"Meadow Green GMC","Condition:":"Excellent","Transmission:":"Auto","Mileage:":"8,400"}}