[
{"src": ["https://assets.hemmings.com/uimage/56651021-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/56651022-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/56651023-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/56651024-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/56651026-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/56651025-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/56651027-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/56651028-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/56651029-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/56651030-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/56651031-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/56651032-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/56651033-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/56651034-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/56651035-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/56651036-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/56651037-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/56651038-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/56651039-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/56651040-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/56651041-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/56651042-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/56651043-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/54579215-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/54579217-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/54579218-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/54579219-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/54579220-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/54579221-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/54579222-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/54579223-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/54579224-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/54579225-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/54579227-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/54579228-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/54579230-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/54579231-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/54579233-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/54579234-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/54579236-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/54579237-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/54579239-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/54579240-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/54579242-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/54579243-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/54579245-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/54579247-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/54579248-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/54579250-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/56651044-770-0@2X.jpg?rev=1"], "mileage": "", "seller_name": "MotoeXotica Classic Cars", "title": "1967 Alfa Romeo Duetto Spider", "total_results": " 124", "price": "35900", "page_count": 9.0, "year": "1967", "href": "https://www.hemmings.com/classifieds/dealer/alfa-romeo/duetto/1819207.html", "brand": "Alfa", "reference_id": "1819207", "kilometers": "", "model": "Romeo", "specs": {"Interior:": "Black", "Location:": "St. Louis, Missouri,  63026", "description": ["1967 Alfa Romeo “Duetto” Boattail Spider 1600", "Identical to the Alfa Dustin Hoffman drove in the movie “The Graduate”", "Highly desirable red with black leather interior with red piping", "Matching numbers car", "Zero miles since restoration", "Pinninfarina designed with only 6,341 produced between 1966 and 1967", "1.6 liter overhead cam, 4-cylinder engine with dual Weber carburetors", "5-Speed rebuilt manual transmission", "4 wheel disc brakes", "MotoeXotica Classic Cars is pleased to present this extremely rare  1967 Alfa Romeo Duetto Boattail convertible. Finished in the highly desirable Carmen red with black leather roadster, absolutely defies showing it's age, and still day shows very strong. This Pinninfarina designed recently restored spider is 1 of only 6,341 produced between 1966 and 1967.", "The Alfa Romeo Spider  is a roadster  produced by the Italian manufacturer Alfa Romeo  from 1966 to 1993—with small run of 1994 models for the North American market. The Spider remained in production for almost three decades with only minor aesthetic and mechanical changes. To choose a name for the spider Alfa Romeo announced a write-in competition, offering an example of the new car as a prize. Over 100 thousand ballots were sent in; the winner proposed the name Duetto (duet). However the Duetto name could not be officially adopted due to Trademark issues, and the car was named simply Alfa Romeo Spider 1600.", "Finished in deep Carmen red, this Italian bodied roadster shows extremely well with only minor imperfections visible upon close inspection. All the trim is present and is brilliant and displays normal wear. The front and rear bumpers have been rechromed and fit is extremely tight and finish is exquisite. The headlights have crystal clear NOS covers. It also has new rear reflectors, new OEM Euro taillight assemblies and the signal lights have been replaced with NOS parts The weather-stripping is pliable, with little or no signs of drying, tearing or shrinkage. The steel wheels represent well with no major signs of marring or curb rash. The black canvass convertible top fits very well with no visible tearing, and the three rear windows are extremely clear. The car has a black boot that functions as designed and is in great condition.", "Inside, the new rich black leather with red piping front bucket seats and rear cargo compartment and all look great with no major signs of wear visible. The matching black door panels have been replaced , carpet and dashboard are a striking contrast to the red exterior of the car and look fantastic. All gauges are ergonomically place have correct appearance and function as originally designed. The tachometer and speedometer have also been rebuilt. It should be noted that the windshield washers and odometer are inoperable. The original equipment steering wheel and black dashboard adds to the period feel. The original push-button Alfa radio completes the interior's cockpit. Please note, the previous owner sold the vehicle on an actual (70,000) mileage title, reset the odometer to “0” after restoration. While the odometer is inoperable, the trip-odometer does work.", "This nicely represented Alfa is equipped with a rebuilt dual Weber DCOE carburetors  1.6 liter overhead cam, 4-cylinder engine, 5-speed rebuilt manual transmission, 4 wheel disc brakes, Ansa exhaust. It has a new thermostat, new master cylinder, rebuilt clutch, new brakes and alignment, rebuilt front end,  new battery, new tires, new stainless brake hoses, and new wiring. 15-inch alloys with Alfa center caps wrapped with performance radials. We do not have the receipts in hand to back up the prior owner's claim, but all appears to be true.", "Remember college?, how about Mrs. Robinson? Well you can “rush” back to those days in this '67 boattail time machine!…hold on to your pledge pin and GET OUT AND DRIVE!", "Current mileage on the odometer 0,000 It is sold as is on a clean & clear mileage exempt title.", "VIN: AR664115"], "Exterior:": "Red", "Condition:": "Excellent", "Transmission:": "Manual"}},
{"src": ["https://assets.hemmings.com/uimage/61529671-770-0@2X.jpg?rev=3", "https://assets.hemmings.com/uimage/61529673-770-0@2X.jpg?rev=3", "https://assets.hemmings.com/uimage/61529675-770-0@2X.jpg?rev=3", "https://assets.hemmings.com/uimage/61529677-770-0@2X.jpg?rev=3", "https://assets.hemmings.com/uimage/61529679-770-0@2X.jpg?rev=3", "https://assets.hemmings.com/uimage/61529680-770-0@2X.jpg?rev=3", "https://assets.hemmings.com/uimage/61529682-770-0@2X.jpg?rev=3"], "mileage": "", "seller_name": "Catawiki", "title": "1986 Alfa Romeo GTV Coupé", "total_results": " 124", "price": "9000", "page_count": 9.0, "year": "1986", "href": "https://www.hemmings.com/classifieds/cars-for-sale/alfa-romeo/gtv/2051695.html", "brand": "Alfa", "reference_id": "2051695", "kilometers": "", "model": "Romeo", "specs": {"Location:": "Gda?sk, Poland", "description": ["In 1974 the car was introduced under the name Alfa Romeo Alfetta GT. However, after six years it has changed its name and design. Alfa Romeo GTV 2.0 received larger bumpers and wheels, less chrome and a stronger, two-litre engine. The bonnet line was kept as beautiful and timeless as before and all that was designed by Giorgetto Giugiaro at Italdesign. This car can also impress from its technical side - rear-wheel drive, transaxle, brakes that are mounted by differential to reduce unsprung weight, high double wishbone at the front and de Dion axle at the back - Alfa Romeo GTV 2.0 is full of interesting features, that will satisfy not only the driving enthusiast but also the car design lover.This lot can be viewed and picked up in Gdansk, Poland."]}},
{"src": ["https://assets.hemmings.com/uimage/61529715-770-0@2X.jpg?rev=3", "https://assets.hemmings.com/uimage/61529717-770-0@2X.jpg?rev=3", "https://assets.hemmings.com/uimage/61529719-770-0@2X.jpg?rev=3", "https://assets.hemmings.com/uimage/61529721-770-0@2X.jpg?rev=3", "https://assets.hemmings.com/uimage/61529724-770-0@2X.jpg?rev=3", "https://assets.hemmings.com/uimage/61529726-770-0@2X.jpg?rev=3", "https://assets.hemmings.com/uimage/61529728-770-0@2X.jpg?rev=3"], "mileage": "", "seller_name": "Catawiki", "title": "1976 Alfa Romeo Spider 2000 Veloce Cabriolet/Convertible", "total_results": " 124", "price": "24000", "page_count": 9.0, "year": "1976", "href": "https://www.hemmings.com/classifieds/cars-for-sale/alfa-romeo/spider/2051699.html", "brand": "Alfa", "reference_id": "2051699", "kilometers": "", "model": "Romeo", "specs": {"Location:": "Gdansk, Poland", "description": ["Alfa Romeo 2000 Spider Veloce is already a true classic in the pure sense of the word. Over five years ago this beautiful Spider has been painstakingly restored and still shines bright.  Imported from sunny Italy without signs of greater corrosion, has been restored in one of the most renowned car workshops in Poland, where no costs were spared. The previous owner decided to leave as much original parts and elements that decorated the body as possible. Car's bodywork and painting was made by specialists. The same applies to the technical side, such as the engine, transmission, rear axle (differential) and suspension components. Equipment such as the dashboard, centre console, door upholstery remained in its original condition. Seat coverings were rebuilt with top quality leather. Roof covering was made by Sonnenland material which is well known to all professionals. Last owner used the car only in the summer (after the renovation). During the winter it was garaged in a warm, well ventilated garage. Since the renovation the owner has made 12.000 km with this car.I highly recommend this car to anyone who loves to feel the wind in hair, and wants to hear the beautiful sound of a great engine.The offer includes a full documentation of the renovation process of a vehicle. This car can be viewed in Gda?sk."]}},
{"src": ["https://assets.hemmings.com/uimage/61557733-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61557734-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61557735-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61557736-770-0@2X.jpg?rev=2"], "mileage": "", "seller_name": "Coys Grandes Marques, Maastricht ", "title": "1963 Alfa Romeo 2600 Sprint Bertone", "total_results": " 124", "price": "Auction", "page_count": 9.0, "year": "1963", "href": "https://www.hemmings.com/classifieds/cars-for-sale/alfa-romeo/2600-sprint/2053673.html", "brand": "Alfa", "reference_id": "2053673", "kilometers": "", "model": "Romeo", "specs": {"Location:": "Maastricht, Netherlands", "description": ["Introduced in 1962, Alfa Romeo's 106-Series 2600 range was a direct replacement for the preceding 102-Series 2000 cars. The latter's chassis design and body styles were retained, with minor revisions and improvements, but in place of the old, long-stroke, 2.0-litre, four-cylinder engine was a new, 2,584cc, twin-cam six clearly descended from the immensely successful Giulietta. A maximum output of 145bhp was claimed for this unit when installed in the Sprint coupe and Spider, good enough for a top speed of around 200km/h in 5th gear, and Cars Illustrated magazine reckoned this magnificent power unit “one of the smoothest, quietest running sixes, irrespective of the speed at which it is running, in our experience.” Carrozzerias Touring and Bertone were responsible for the 2600 Spider and Sprint Coupe respectively, both of which looked like their 2000 predecessors. Approximately 2,255 Spiders and 6,999 Sprint Coupes were produced between 1962 and 1966, and today these rare and under-appreciated models are becoming increasingly sought after by discerning collectors.This particular example comes from a Danish Alfa Romeo collection where the last owner had the car cared for over the last 10 years. It is mechanically in excellent condition with engine, brakes and gearbox working very well. Fitted with period extra instruments for Volt and Ampere measurement. Bodily the car was subject to a restoration during the previous vendor's tenure. View 1963 Alfa Romeo 2600 Betone Sprint on 'http://www.coys.co.uk/cars/1963-alfa-romeo-2600-betone-sprint' for further details.", "Auction"]}},
{"src": ["https://assets.hemmings.com/uimage/61529648-770-0@2X.jpg?rev=3", "https://assets.hemmings.com/uimage/61529650-770-0@2X.jpg?rev=3", "https://assets.hemmings.com/uimage/61529652-770-0@2X.jpg?rev=3", "https://assets.hemmings.com/uimage/61529654-770-0@2X.jpg?rev=3", "https://assets.hemmings.com/uimage/61529656-770-0@2X.jpg?rev=3", "https://assets.hemmings.com/uimage/61529657-770-0@2X.jpg?rev=3", "https://assets.hemmings.com/uimage/61529658-770-0@2X.jpg?rev=3"], "mileage": "", "seller_name": "Catawiki", "title": "1971 Alfa Romeo GT 1.3 Junior Coupé", "total_results": " 124", "price": "30000", "page_count": 9.0, "year": "1971", "href": "https://www.hemmings.com/classifieds/cars-for-sale/alfa-romeo/gt/2051693.html", "brand": "Alfa", "reference_id": "2051693", "kilometers": "", "model": "Romeo", "specs": {"Location:": "Satriano di lucania, Italy", "description": ["Car has ASI certificate that allows you to benefit from insurance facilitation (in Italy). Engine and mechanics are in an excellent condition, the following recent works were done: replacement of engine, gearbox and differential oil, spark plugs, perfect redone carburetion, radiator overhauled.The bodywork was repainted about ten years ago and it is currently in an very good condition. Always belonged to the same family. From the uncle the ownership was then moved to the nephew. It was originally purchased in Germany in 1971 by a passionate Italian Alfa fan, who lived there for business reasons. After only 3 years, in 1974, he returned home bringing back with him this Italian motoring masterpiece. The car was regularly registered, receiving Italian documents and plates and remained there until now.At his death, the car passed to his nephew who kept it for 3 years, after which he decided to sell it because unused.The odometer and rev counter have been overhauled because they \"trembled\" and the odometer was reset.Tyres at 90%- Leather Alfa Romeo suitcase included with car.- Original vintage registration bookletThe car is ready to run on the road.Please note: small dent on rear bumper, on the right side (as shown in photos).Transport across Europe and Italy can be arranged at competitive prices.The vehicle can be viewed and picked up in Imperia, Italy."]}},
{"src": ["https://assets.hemmings.com/uimage/61529616-770-0@2X.jpg?rev=3", "https://assets.hemmings.com/uimage/61529617-770-0@2X.jpg?rev=3", "https://assets.hemmings.com/uimage/61529620-770-0@2X.jpg?rev=3", "https://assets.hemmings.com/uimage/61529622-770-0@2X.jpg?rev=3", "https://assets.hemmings.com/uimage/61529623-770-0@2X.jpg?rev=3", "https://assets.hemmings.com/uimage/61529625-770-0@2X.jpg?rev=3", "https://assets.hemmings.com/uimage/61529627-770-0@2X.jpg?rev=3"], "mileage": "", "seller_name": "Catawiki", "title": "1984 Alfa Romeo Giulietta 1.6 Limousine", "total_results": " 124", "price": "6500", "page_count": 9.0, "year": "1984", "href": "https://www.hemmings.com/classifieds/cars-for-sale/alfa-romeo/giulietta/2051691.html", "brand": "Alfa", "reference_id": "2051691", "kilometers": "", "model": "Romeo", "specs": {"Location:": "Bari, Italy", "description": ["DETAILS- Valid inspection: yes- Number plates and documents: Italian- Owners: 3- Colour: metallic “luci di bosco” (wood lights)- Engine: 1600 cc- Underbody condition: no problemDESCRIPTIONFrom private collection, Alfa Romeo Giulietta 1.6 from 1984, third series, very well preserved. A car for real connoisseurs of the brand, a classic Italian vehicle with sure revaluation over time.Preserved with great care, original orange and white number plates, original metallic “luci di bosco” paint (still with labels and wax - as in the details of the picture), velvet interior in as new condition, front electric windows.  No rust, always kept in heated garage and never driven on rainy days. Already ASI certified. Eligible for ASI Golden Plate. Only 3 owners including me.The engine is clean and in order (as in the pictures). It runs perfectly and has driven 59,830 km (original).Mechanics and electronic components are perfectly functioning. Tyre with recent Dot at 90%.The car also has double keys.Prior agreement with the buyer, we can take care of sale practices and transportation abroad.Transport costs, papers fee and Italian sale taxes are charged to the buyer.Notes: Small imperfections highlighted in the pictures.The vehicle can be viewed and picked up in Bari, Italy."]}},
{"src": ["https://assets.hemmings.com/uimage/61529659-770-0@2X.jpg?rev=3", "https://assets.hemmings.com/uimage/61529660-770-0@2X.jpg?rev=3", "https://assets.hemmings.com/uimage/61529661-770-0@2X.jpg?rev=3", "https://assets.hemmings.com/uimage/61529663-770-0@2X.jpg?rev=3", "https://assets.hemmings.com/uimage/61529665-770-0@2X.jpg?rev=3", "https://assets.hemmings.com/uimage/61529667-770-0@2X.jpg?rev=3", "https://assets.hemmings.com/uimage/61529669-770-0@2X.jpg?rev=3"], "mileage": "", "seller_name": "Catawiki", "title": "1971 Alfa Romeo GT Junior Coupé", "total_results": " 124", "price": "23000", "page_count": 9.0, "year": "1971", "href": "https://www.hemmings.com/classifieds/cars-for-sale/alfa-romeo/gt/2051694.html", "brand": "Alfa", "reference_id": "2051694", "kilometers": "", "model": "Romeo", "specs": {"Location:": "Sinopoli, Italy", "description": ["Details:Original registration document and certificate of ownership availableValid inspection: yes Previous owners: 4DESCRIPTIONAlfa Romeo - 1300 GT Junior from 1971 in very good condition, restored by the previous owner in 2002. High gloss paint, no external damage, only slight pebble damages on front. Underbody in very good condition, leather interior very good, serviced engine, carburettors aligned, gearbox and clutch very good, suspension and wheels good, millemiglia rims.The front is from 1750 version with double headlight (original grille available). The 1.3 junior was born with only two headlights. This vehicle can be viewed and picked up in Sinopoli (RC), Italy."]}},
{"src": ["https://assets.hemmings.com/uimage/61529630-770-0@2X.jpg?rev=3", "https://assets.hemmings.com/uimage/61529633-770-0@2X.jpg?rev=3", "https://assets.hemmings.com/uimage/61529637-770-0@2X.jpg?rev=3", "https://assets.hemmings.com/uimage/61529638-770-0@2X.jpg?rev=3", "https://assets.hemmings.com/uimage/61529641-770-0@2X.jpg?rev=3", "https://assets.hemmings.com/uimage/61529644-770-0@2X.jpg?rev=3", "https://assets.hemmings.com/uimage/61529645-770-0@2X.jpg?rev=3"], "mileage": "", "seller_name": "Catawiki", "title": "1963 Alfa Romeo Giulietta Spider Cabriolet/Convertible", "total_results": " 124", "price": "64000", "page_count": 9.0, "year": "1963", "href": "https://www.hemmings.com/classifieds/cars-for-sale/alfa-romeo/giulietta/2051692.html", "brand": "Alfa", "reference_id": "2051692", "kilometers": "", "model": "Romeo", "specs": {"Location:": "Ruinen, Netherlands", "description": ["Alfa Giulietta Spider AR370283 was sold on 19 April 1963 to Mr Enrico Ambrogi by North Country Motors in New York. In the late 1970s the Spider was used as daily means of transport by a Dutch pilot during his studies in Michigan and Las Vegas. In 1981 the car was taken back to the Netherlands. It hasn't been driven since. The Spider is now completely restored in stages in which the entire bottom is taken care of by a professional company. The engine is completely overhauled: new pistons, cylinders, bearings and completely balanced. The cylinder head is fitted with new valves, valve guides and valve seats. Furthermore, the brakes are overhauled, new Koni shock absorbers are placed and the car has a new exhaust. Also the carburetor is completely overhauled. This car is in very good condition; No rust, no filler. Due to circumstances it is still not entirely finished; What should be done: Remanufactured cylinder head should be mounted.The electrical wiring connected (wiring harness is already mounted)Brakes must be ventedClutch pedal needs to be connectedThe hood has yet to be mountedAlso various small work. The car is completely repainted in the 1990s, but now shows blisters on some spots. The accompanying hood is brand new, but has a damage which is provisionally repaired. The door panels on the inside are missing, as well as the rubber mat in the trunk: any missing parts can be obtained in the trade: this will require an investment of roughly €1000,-.   The bumpers have yet again to be chromed and mounted. The Spider is on the front fitted with the large brake drums with three brake shoes. After 27 years it is time that the Spider went to a new owner who takes it on the road.  A special opportunity for the enthusiast or restoration company!  This vehicle can be viewed and collected in Ruinen, the Netherland."]}},
{"src": ["https://assets.hemmings.com/uimage/61557741-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61557742-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61557743-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61557744-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61557745-770-0@2X.jpg?rev=2"], "mileage": "", "seller_name": "Coys Grandes Marques, Maastricht ", "title": "1958 Alfa Romeo Giulietta 750D Spyder", "total_results": " 124", "price": "Auction", "page_count": 9.0, "year": "1958", "href": "https://www.hemmings.com/classifieds/cars-for-sale/alfa-romeo/giulietta/2053675.html", "brand": "Alfa", "reference_id": "2053675", "kilometers": "", "model": "Romeo", "specs": {"Location:": "Maastricht, Netherlands", "description": ["‘The Alfa, in a few words then, is a small car with a rev-happy DOHC engine that can carry two people from point A to point B over all types of roads quicker than most cars twice its size. It does this not with blinding speed but with a wonderful combination of roadholding, compact size and sheer willingness' – Car & Driver on the Giulietta.With the introduction of the Giulietta in 1954, Alfa Romeo established the ‘small car, big performance' formula that would characterize its finest offerings from that point on. The Giulietta's arrival caused a sensation; demand quickly outstripped supply, causing Alfa Romeo to rethink its production strategy and become a high-volume manufacturer.Designed by Pinin Farina on a modified Sprint Coupe chassis, the Alfa Romeo Giulietta Spider was the company's second post-war model. The little two-seat Sports Spider was introduced in 1955 at the insistence of New York importer Max Hoffman, who saw how well small British and German sports cars were being received in America. The Giulietta Spider offered brisk performance (almost 100 mph) from its free-revving, all-alloy, 1.3-liter twin-cam four, mounted in a steel unibody chassis that weighed less than 1900lbs at the curb. The design was unmistakably Pinin Farina – very elegant, sporting and lithe.From the time of their introduction, both the Sprint and Spider provided an exhilarating combination of character and performance, within the limits of what was possible with the well-designed twin-cam engine. However, as with pre-war Alfa Romeos, the dealers soon saw a demand for an uprated version for buyers with competition in mind. In 1956, the Giulietta Sprint and Spider Veloces duly appeared, with high-performance engines and modified bodywork. High-crown pistons raised the compression ratio to 9.1:1 which, with a pair of twin-choke Weber carburetors and more peaky camshaft profiles, raised the power by about 15%. Performance was certainly improved, with a top speed of 115mph and a more responsive engine through and through. Just 2,796 Giulietta Spider Veloces were produced, and they remain among the most collectible of the model today.This matching numbers example is finished in black over red and is in excellent condition. We are informed that the bright work is in equally good order. Mechanically the car comes with a large history file and is described as being mechanically perfect, with a big service just been carried out as well as chrome.  A very early 1st series car , which are the most desirable amongst the Alfa Romeo cognoscentiView 1958 Alfa Romeo Giulietta 750D Spyder on 'http://www.coys.co.uk/cars/1958-alfa-romeo-giulietta-750d-spyder' for further details.", "Auction"]}},
{"src": ["https://assets.hemmings.com/uimage/61557746-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61557747-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61557748-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61557749-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61557750-770-0@2X.jpg?rev=2"], "mileage": "", "seller_name": "Coys Grandes Marques, Maastricht ", "title": "1959 Alfa Romeo Giulietta Sprint", "total_results": " 124", "price": "Auction", "page_count": 9.0, "year": "1959", "href": "https://www.hemmings.com/classifieds/cars-for-sale/alfa-romeo/giulietta/2053676.html", "brand": "Alfa", "reference_id": "2053676", "kilometers": "", "model": "Romeo", "specs": {"Location:": "Maastricht, Netherlands", "description": ["The Alfa, in a few words, is a small car with a rev-happy dohc engine that can carry two people from point A to point B over all types of roads quicker than most cars twice its size. It does this not with blinding speed but with a wonderful combination of roadholding, compact size and sheer willingness.' – Car & Driver on the Giulietta Sprint.With the introduction of the Bertone-styled Giulietta Sprint in 1954, Alfa Romeo established the ‘small car, big performance' formula that would characterise the Milanese marque's finest offerings from then on. Alfa's classic twin-cam four was downsized to 1,290ccc for the 750-Series Giulietta, gaining an alloy cylinder block in the process. The Sprint coupe was soon joined by Berlina and Spider versions, the latter styled by Pinin Farina and built on a slightly shorter wheelbase. The Giulietta family's success surprised even Alfa themselves; production targets were revised upwards and to satisfy demands for increased performance, upgraded Veloce versions of the Sprint and Spider were introduced. The combination of a rev-happy engine, fine-handling, responsive chassis and excellent brakes make the Giulietta Sprint a driver's car par excellence and explains why these stylish Alfa Romeos continue to attract the discerning enthusiast today.This charming 1959 example, finished in Alfa Romeo Red with a black interior has come from Sweden, and is offered with certificate di origine. Fitted with a desirable 1600 engine this little alfa will perform as well as it looks.View 1959 Alfa Romeo Giulietta Sprint on 'http://www.coys.co.uk/cars/1959-alfa-romeo-giulietta-sprint' for further details.", "Auction"]}},
{"src": ["https://assets.hemmings.com/uimage/60672911-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/60672912-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/60672913-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/60672914-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/60672915-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/60672916-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/60672917-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/60672918-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/60672919-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/60672920-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/60672921-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/60672922-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/60672923-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/60672924-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/60672925-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/60672926-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/60672927-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/60672928-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/60672929-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/60672930-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/60672931-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/60672932-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/60672933-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/60672934-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/60672935-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/60672936-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/60672937-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/60672938-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/60672939-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/60672940-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/60672941-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/60672942-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/60672943-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/60672944-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/60672945-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/60672946-770-0@2X.jpg?rev=1"], "mileage": "", "seller_name": "Beverly Hills Car Club", "title": "1965 Alfa Romeo Sprint GT", "total_results": " 124", "price": "29500", "page_count": 9.0, "year": "1965", "href": "https://www.hemmings.com/classifieds/dealer/alfa-romeo/sprint/2010999.html", "brand": "Alfa", "reference_id": "2010999", "kilometers": "", "model": "Romeo", "specs": {"Exterior:": "Red", "Transmission:": "Manual", "Location:": "Beverly Hills, California,  90210", "Condition:": "Good", "description": ["'65 Alfa Romeo Sprint GT shown here is available in red with black interior. It comes equipped with a manual transmission, side mirrors, dual carburetors and with solid wheels. It could use some light cosmetics and has lots of potential especially now as the Alfas are climbing in value. An excellent original West Coast car which is mechanically sound.", "For $29,500 USD", "If you have any additional questions Please call 310-975-0272", "Check out our YouTube Channel:", "http://www.youtube.com/user/BevHillsCarClubInc"]}},
{"src": ["https://assets.hemmings.com/uimage/61567205-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567206-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567207-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567208-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567209-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567210-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567211-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567212-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567213-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567214-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567215-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567216-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567217-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567218-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567219-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567220-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567221-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567222-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567223-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567224-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567225-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567226-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567227-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567228-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567229-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567230-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567231-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567232-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567233-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567234-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567235-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567236-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567237-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567238-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567239-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567240-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567241-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567242-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567243-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567244-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567245-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567246-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567247-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567248-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567249-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567250-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567251-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567252-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567253-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61567254-770-0@2X.jpg?rev=2"], "mileage": 47242.0, "seller_name": "Legendary Motors LLC", "title": "1982 Alfa Romeo GTV6 Balocco S.E.", "total_results": " 124", "price": "12500", "page_count": 9.0, "year": "1982", "href": "https://www.hemmings.com/classifieds/dealer/alfa-romeo/gtv6/2054087.html", "brand": "Alfa", "reference_id": "2054087", "kilometers": 76012.378, "model": "Romeo", "specs": {"Interior:": "Black", "Location:": "Beverly, Massachusetts,  01915", "description": ["1982 Alfa Romeo GTV6 Balocco S.E. this Balocco edition Alfa is number 328 of 350 produced for 1982.  The Balocco is named after the Circuito di Balocco road-testing track in northern Italy.  The Balocco edition GTV6 was only available in red with black accents.  The interior featured red carpets and black leather seating and steering wheel trim.", "This 1982 Alfa Romeo GTV6 Balocco S.E. is a one owner car with only 47,242 miles as shown on the odometer and fully documented with maintenance records since new.  The exterior red paint is in very good condition and appear to be mostly original with exception of a few areas that were previously repainted due to minor dent repair.", "The underside is extremely clean as well as no apparent rust along the lower body lines.  This would attribute to the pride in ownership and the limited original miles.  The inside of this car again is in very good condition with no obvious areas of excessive wear.", "If you are an Italian car enthusiast and looking for a low miles documented coupe this is the Alfa Romeo for you."], "Exterior:": "Red", "Condition:": "Excellent", "Transmission:": "Manual", "Mileage:": "47242"}},
{"src": ["https://assets.hemmings.com/uimage/61559906-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61559907-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61559908-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61559909-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61559910-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61559911-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61559912-770-0@2X.jpg?rev=2", "https://assets.hemmings.com/uimage/61559913-770-0@2X.jpg?rev=2"], "mileage": 59197.0, "seller_name": "Bring A Trailer", "title": "1964 Alfa Romeo Giulia", "total_results": " 124", "price": "Auction", "page_count": 9.0, "year": "1964", "href": "https://www.hemmings.com/classifieds/cars-for-sale/alfa-romeo/giulia/2053829.html", "brand": "Alfa", "reference_id": "2053829", "kilometers": 95247.973, "model": "Romeo", "specs": {"Location:": "Columbus, Ohio,  43221", "description": ["This 1964 Alfa Romeo Giulia Spider 1600 has remained with the same family for over 30 years, nearly half of which was spent with the seller. Believed to have been a southern California car until it was shipped to Ohio by the seller's in-laws in 1995, it is powered by a 1600cc four that was rebuilt in 2005 and is described as a nice and attention-getting driver with some needs. Recent work included draining and refilling of the fuel tank and an oil and coolant change as well as a new center link, tie rods, new wheel cylinders, and new spark plugs. Included service records date to 2005 and the car is sold with a clean Ohio title. This listing is live now, and only for 7 days, so take a look at the current bidding and live discussion here at", "https://bringatrailer.com/listing/1964-alfa-romeo-giulia-spider/", "Auction"], "Mileage:": "59197"}},
{"src": ["https://assets.hemmings.com/uimage/60704170-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/60704171-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/60704172-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/60704173-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/60704174-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/60704175-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/60704176-770-0@2X.jpg?rev=1"], "mileage": 53095.0, "seller_name": "ERclassics", "title": "1956 Alfa Romeo Giulietta Spider 750D 1956 Restored Matching Numbers", "total_results": " 124", "price": "135050", "page_count": 9.0, "year": "1956", "href": "https://www.hemmings.com/classifieds/dealer/alfa-romeo/giulietta/2013223.html", "brand": "Alfa", "reference_id": "2013223", "kilometers": 85429.855, "model": "Romeo", "specs": {"Interior:": "Black Leather", "Location:": "Waalwijk, NETHERLANDS", "description": ["Alfa-Romeo Giuletta Spider 750D 1956 restored Matching Numbers", "For sale a unique early Alfa Romeo Giuletta Spider 750D from 1956. Delivered to Hoffman in USA. Car is restored and had Corsa Rosso Piant and beautiful chrome. Matching numbers 1290 cc engine. Car runs and drives great, leather interior. Great investment potential.", "For US customers:", "Our cars can be picked up from our New Jersey warehouse (Linden, NJ) from Monday till Saturday.", "Price for shipping a car from The Netherlands to our New Jersey warehouse including handling fees is USD 1500. This price excludes 3% import duties and excludes shipping from NJ to your home address.", "Our staff in New Jersey can quote you home delivery.", "Buy your classic car safe and secure from the biggest classic car dealer in Europe. We have shipped thousands of classic cars from/to buyers and sellers in the USA and worldwide. All cars are priced in USD. You can pay on our US bank account so no exchange rate issues for you.", "Car has european title. Easy to register in the USA.", "For more than 80 pictures, a small video and availability, look at our website www.erclassics.com", "Always 250 classic cars in our showroom in the Netherlands!", "ERclassics, Kleiweg 1, 5145 NA  WAALWIJK", "Telephone: + 31 416751393", "Showroom open Monday till Saturday 09.00-17.00hrs and the first Sunday of the month 12.00-16.00hrs.  All cars we advertise are in our showroom in the Netherlands.", "No liability for price changes and errors."], "Exterior:": "Red", "Condition:": "Excellent", "Transmission:": "Manual", "Mileage:": "53095"}},
{"src": ["https://assets.hemmings.com/uimage/61244197-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/61244198-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/61244199-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/61244200-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/61244201-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/61244202-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/61244203-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/61244204-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/61244205-770-0@2X.jpg?rev=1", "https://assets.hemmings.com/uimage/61244206-770-0@2X.jpg?rev=1"], "mileage": "", "seller_name": "Country Classic Cars", "title": "1986 Alfa Romeo Spider Veloce Convertible", "total_results": " 124", "price": "11750", "page_count": 9.0, "year": "1986", "href": "https://www.hemmings.com/classifieds/dealer/alfa-romeo/spider/2037585.html", "brand": "Alfa", "reference_id": "2037585", "kilometers": "", "model": "Romeo", "specs": {"Exterior:": "Gold", "Transmission:": "Manual", "Location:": "Staunton, Illinois,  62088", "Condition:": "Good", "description": ["Convertible, great body, nice new slick paint, nice redone int, good orig top, well kept, 72,xxx actual miles, new fuel pump, full tune up, 4cyl, 5spd, power disc brakes, pw, a/c, new tires, fun little car, runs/drives great"]}}
]