[
{"src": ["https://assets.hemmings.com/uimage/62602842-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602843-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602844-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602845-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602846-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602847-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602848-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602849-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602850-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602851-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602852-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602853-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602854-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602855-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602856-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602857-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602858-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602859-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602860-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602861-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602862-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602863-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602864-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602865-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602866-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602867-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602868-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602869-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602870-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602871-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602872-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602873-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602874-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602875-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602876-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602877-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602878-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602879-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602880-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602881-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602882-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602883-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602884-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602885-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602886-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602887-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602888-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602889-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602890-770-0@2X.jpg?rev=27", "https://assets.hemmings.com/uimage/62602891-770-0@2X.jpg?rev=27"], "mileage": 67598.0, "seller_name": "Worldwide Vintage Autos", "title": "1955 Chevrolet 3600 for Sale", "total_results": " 16", "price": "24900", "page_count": 2.0, "year": "1955", "href": "https://www.hemmings.com/classifieds/dealer/chevrolet/3600/2101238.html", "brand": "Chevrolet", "reference_id": "2101238", "kilometers": 108765.182, "model": "3600", "specs": {"Interior:": "Green", "Location:": "Denver, Colorado,  80216", "description": ["Worldwide Vintage Autos is pleased to present this 1955 Chevrolet 3600. THE ULTIMATE NAPCO 4x4 COLLECTOR TRUCK. As rare as they come. Special order Utah truck.", "HISTORY", "1955 First Series - Similar to the 1954 model year, except redesigned hood-side emblems and modern open driveshaft in place of enclosed torque tube. Serial number codes unchanged from 1953 and 1954. SOURCE:  WIKIPEDIA", "SPECIFICS / BUILD INFORMATION", "EXTERIOR", "-Very rare FIRST SERIES 3600 3/4 ton truck with its original Napco 4x4 conversion. One of the first Chevy 4x4 civilain trucks in existence.", "-Original numbers matching Napco 4wd system (axle, transfer case, etc).", "-VERY EARLY kit with serial number A1225!", "-Frame off restored. Full chassis restoration from 2013-2015.", "-New paint and bodywork. Timber grown.", "-Ultra rare factory 19.5\" steel wheels. Bead-blasted and painted. These wheels are next to impossible to find.", "-Chevy hubcaps.", "-Brand new era correct pizza cutter off road tires!", "-Factory heavy duty rear bumper option.", "-Napco and 3600 emblems.", "INTERIOR", "-Reupholstered front bench seat.", "-New headliner.", "-Rubber floor matting.", "-Original dash and gauges.", "MECHANICAL", "-Original 235 Inline 6 was rebuilt by Machine Shop. Rex Hutchinson Racing.", "-Rebuilt transfer case.", "-Rebuilt front and and rear axles.", "-New seals, bearings, etc.", "-All new brakes, brake lines, cylinders, etc.", "-New shocks.", "-New clutch.", "-New spindles and new Selectro Hubs.", "-New driveshafts and U joints.", "DISCLOSURE", "-Paint and body are driver quality. There are a few chips / imperfections in the paint / body. (See detailed pictures)", "-Some imperfection in the from grille. (See detailed pictures)", "-Side vent window has \"age bubbling\".  (See detailed pictures)", "For more details on any disclosure items please contact a sales agent today at 1-877-422-2940.", "The cost of parts and restoration of these vehicles are increasing daily. They are not making any more and, therefore, they are becoming more rare by the day. Buy one complete and ensure your investment for the future. An excellent investment and something you can enjoy daily. Collectible vintage vehicles have historically appreciated at a rate greater than that stock market, gold and other arts and collectibles as documented by many articles and auction result tracking.", "NEED MORE DETAILED INFORMATION? CALL US AND WE WILL HELP ANY WAY POSSIBLE!", "1-877-422-2940", "WORLDWIDE VINTAGE AUTOS [. C O M ]", "FINANCING:", "JJ BEST BANC. COLLECTOR CAR FINANCING", "800-872-1965", "Please mention you are working with Worldwide Vintage Autos in order to expedite the process.  For financing, Down Payment required by lending institution will be due within 72 hours of deposit in addtion to deposit. Down Payment is refundable.", "DEPOSITS", ":", "Deposits to hold vehicles is $500. Upon payment of the $500 deposit, the vehicle will be held for 72 hours pending final payment. Deposits are non-refundable due to i). the vehicles are taken off the market and we turn down other buyers during the 72 hour period and ii). there is significant re-marketing costs associated with relisting / remarketing our vehicles. Inspections should be performed prior to putting a deposit down on a vehicle.", "INSPECTIONS", ":", "We encourage inspections. We disclose known defects and imperfections but we are not you. Purchasing a vehicle is very subjective. Come visit our showroom in Denver, CO, we would love to meet you in person! We require inspections to be done prior to putting down a deposit.", "SHIPPING", ":", "We recommend having our shipping coordinator facilitate the transport of your new vehicle.  We can handle all shipping arrangements in-house, so you know where your vehicle is from point ‘A’ to point ‘B’. We highly suggest using only enclosed shipping to protect your investment.  We use Central Dispatch and they ensure all carriers are licensed, insured and bonded.", "INTERNATIONAL BUYERS:", "We have sold and shipped vehicles all over the world, with happy customers in Canada, Europe, Australia, New Zealand, Japan, South America, and the Middle East, just to name a few.  We can assist with the transport to your home port anywhere in the world, as well as help with the required export/import paperwork.  We recommend the following import/export contacts:", "• Halmari, in Houston, TX @ 1-713-644-0444", "• Schumacher Global Transport @ 1-800-599-0190", "We specialize in:", "1. Vintage trucks and 4x4’s! Pinzgauer, Unimog, Defender, Bronco, Land Cruiser FJ40 FJ45 FJ55, International Scout, Jeep Willys, Dodge Power Wagon, Nissan Patrol, Ford Truck 4x4s, Chevy Truck 4x4s, NAPCO, Marmon Herrington, etc.", "2. Vintage American Cruisers! Cadillac Biarritz, Chrysler, Lincoln Continental, Oldsmobile, Convertible, Mercury, DeSoto, Ford, Chevy Belair, etc. and;", "3. Muscle cars! Camaro, Chevelle, Nova, Challenger, Charger, Corvette, Biscayne, Cobra, Torino, Mustang, AMX, Falcon, Demon, Dart, etc. and;", "4. European Classics! Porsche, 356, Speedster, Mercedes Benz, Austin Healey, Austin Martin, Rolls Royce, Volkswagen Microbus, MG, etc....", "We would love to meet you in person and encourage you to come see the vehicles before you buy!", "Due to our inventory size, we are unable to drive every vehicle for long distances. We also cannot guarantee that every gauge, light, window, horn, option, function, etc., will work as it should. Please check your local state inspection requirements. We do our best to inspect these vehicles in every detail, and note any imperfections in the advertisement. PLEASE NOTE THAT WE DO NOT GUARANTEE ANY AIR CONDITIONING SYSTEMS, GAUGES, OR ELECTRICAL SYSTEMS.  GIVEN THE NATURE OF THE VINTAGE VEHICLES WE SELL, THESE COMPONENTS CAN BE WORKING AT ONE MOMENT AND NOT WORKING AT ANOTHER MOMENT. IT IS COMMON THAT THESE COMPONENTS WILL NEED UPKEEP OR ATTENTION. IN ADDITION, MANY TIMES THESE VEHICLES SIT FOR LONG PERIODS OF TIME AND ONCE YOU BEGIN TO DRIVE THEM SEALS HARDEN AND GASKETS MAY BEGIN TO LEAK! CLASSIC CARS LEAK. PLEASE MAKE SURE YOU ARE COMFORTABLE WITH THIS BEFORE BUYING A VINTAGE AUTOMOBILE.", "Please call a sales expert to get details on these systems", "1-877-422-2940.", "CLASSIC CAR RESTORATIONS:", "The term \"restoration\" in context to the vintage car world has taken on a definition of its own. For some people, a restoration is simply painting a car and replacing items as needed, while for others, restoration means an extensive disassembly and overhaul, with each piece getting rebuilt or replaced.", "As a consumer, it's important to understand the basics of restoration levels for it can impact classic car values substantially. There are hundreds of ways to “restore” a vintage car or truck including but not limited to the following: i).", "Frame off restoration.", "Body of vehicle is completely taken off the frame and restoration includes body, frame, floor pans (top and bottom), etc. these restorations tend to be extensive and costly. ii).", "Rotisserie restoration.", "These restorations are when the body (or body and frame on a unibody vehicle) are disassembled and restored utilizing a rotisserie. Body of vehicle is completely taken off the frame and restoration includes body, frame, floor pans (top and bottom), etc. these restorations tend to be extensive and costly and iii).", "Cosmetic or “driver quality” restoration.", "These restoration are typically limited to cosmetic items including paint and body, interior, trim and emblems, etc. Within the three levels or restoration mentioned above, there can be varying quality from an “in the garage / amateur” restoration to a high dollar professional “concours” restoration. There is a universal 100 point grading system rating classic car conditions ranging from 100 being excellent to 20 being unrestorable.", "In addition to the levels of restoration above, it's important to understand the type of restoration as well for it can also impact value substantially. Type of restorations include: i).", "Factory or stock restoration.", "This type of restoration is geared towards restoring the car or truck to stock specs from the factory as if it were new. These types of restorations use original or oem (original equipment manufacturer) where possible. Factory original restorations tend to bring the highest dollars from collectors. ii).", "Custom restoration.", "These types of restorations are geared towards builder preference over factory stock. These can be refereed to as “customs” or “hot rods”. Typically these vehicles will have custom paint work, aftermarket wheels, suspension upgrades, power plant transplants, etc. A specific sector of custom restoration vehicles is “pro-touring” or “restomod / restomods” which are custom built with a more modern street performance and creature comforts than the original factory vehicle.", "Please note that WWVA is not a restoration shop nor do we restore vehicles to any degree.", "For questions on what type or level of restoration of any of our vehicles in inventory please call our vintage sales expert today at 1-877-422-2940.", "We provide approximately 75 HD images, and an HD video, in every one of our listings.  Very few companies offer this much detail.  We spend significant time inspecting and disclosing detailed items on all of our vehicles; however, at the end of the day, we are not you... we highly suggest that you come and inspect the vehicle.", "The information contained in this ad is solely for convenience.  The description is an opinion only and should not be considered a complete description of any or all faults; it may not be relied upon nor taken as fact or otherwise a representation or warranty of any sort.  Please note, we did NOT build or restore the vehicle. Vehicles are sold AS-IS, WHERE-IS with all faults known/unknown and with no implied warranty.  Unless shown in the photographs, we do NOT have documentation, receipts, or photographs of the vehicle listed.", "We do not recommend driving a classic car home. Many classic cars are not driven often and tend to sit for long periods of time making them unsuitable for cross-country road trips. We strongly recommend shipping the vehicle.", "We sell our vehicles mileage-exempt, meaning we do not know the actual, original miles. The information listed in the ad is based on the current odometer reading or from rebuild information provided by the builder, and cannot be used as fact.", "Most of these vehicles do not have Carfax or Autocheck history reports; unless the vehicle is 1981 or newer, a Carfax or Autocheck history will not exist.", "This vehicle is being sold by Worldwide Vintage Autos. All of our prices include a 30 temporary license plate, a clear Colorado title and VIN verification to ensure no surprises during the registration of your vehicle. We do not charge any additional dealer and handling fees!", "Any vehicle listed in auction format may be sold, and removed from auction, at any time.", "Have a classic vehicle to trade or sell?  Check our website for consignment information.", "CALL OUR SALES TEAM!", "1-877-422-2940", "MONDAY-FRIDAY 9AM-6PM, APPT ONLY", "SATURDAY 10AM-4PM, APPT ONLY", "SUNDAY - CLOSED", "After selling thousands of classic vehicles, we understand the process and will ensure that you have a pleasurable experience.  Check out our 100% positive eBay rating."], "Exterior:": "Green", "Transmission:": "Manual", "Mileage:": "67,598"}}
]